data_generation/simulation_results/case_50/constant/simParams
nIter 2000;
hComponent0 2042.041588731355;
hComponent1 2210.9792769076466;
hComponent2 3665.7982855084756;
hComponent3 2575.6634871256842;
hComponent4 2291.9335965817218;kComponent0 75.59880975193585;
kComponent1 88.02658594322418;
kComponent2 69.88646393009152;
kComponent3 34.71508030973668;
kComponent4 79.33306726497166;
tAmbient 300;
Ux 1.7011694427213409;
kPCB 0.2719574801663948;